---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures.NonStringParameterValue
source: html/4658d262-4acf-a7a3-2c81-e44e160b8f74.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures.NonStringParameterValue Property

The given parameter requires a string value.

## Syntax (C#)
```csharp
public static FailureDefinitionId NonStringParameterValue { get; }
```